microbuilder/LPC11U_LPC13U_CodeBase/src/boards/lpcxpresso1347/board_lpcxpresso1347.h
    CFG_LED_PORT              The port for the on board LED
    CFG_LED_PIN               The pin for the on board LED
    CFG_LED_ON                The pin state to turn the LED on (0 = low, 1 = high)
    CFG_LED_OFF               The pin state to turn the LED off (0 = low, 1 = high)

    -----------------------------------------------------------------------*/
    #define CFG_LED_PORT                  (0)
    #define CFG_LED_PIN                   (7)
    #define CFG_LED_ON                    (1)
    #define CFG_LED_OFF                   (0)
/*=========================================================================*/


/*=========================================================================
    ADC
    -----------------------------------------------------------------------

    CFG_ADC_MODE_LOWPOWER     If set to 1, this will configure the ADC
                              for low-power operation (LPC1347 only)
    CFG_ADC_MODE_10BIT        If set to 1, this will configure the ADC
                              for 10-bit mode (LPC1347 only)

    -----------------------------------------------------------------------*/
    #define CFG_ADC_MODE_LOWPOWER       (0)
    #define CFG_ADC_MODE_10BIT          (0)
/*=========================================================================*/


/*=========================================================================
    UART
    -----------------------------------------------------------------------

    CFG_UART_BAUDRATE         The default UART speed.  This value is used
                              when initialising UART, and should be a
                              standard value like 57600, 9600, etc.
                              NOTE: This value may be overridden if
                              another value is stored in EEPROM!
    CFG_UART_BUFSIZE          The length in bytes of the UART RX FIFO. This
                              will determine the maximum number of received
                              characters to store in memory.

    -----------------------------------------------------------------------*/
    #define CFG_UART_BAUDRATE           (115200)
    #define CFG_UART_BUFSIZE            (256)
/*=========================================================================*/


/*=========================================================================
    SPI
    -----------------------------------------------------------------------

    CFG_SSP_SCK0_LOCATION     The location of the SCK pin for SSP0
    CFG_SSP_MISO1_LOCATION    The location of the MISO1 pin for SSP1
    CFG_SSP_MOSI1_LOCATION    The location of the MOSI1 pin for SSP1
    CFG_SSP_SCK1_LOCATION     The location of the SCK pin for SSP1

    -----------------------------------------------------------------------*/
    #define CFG_SSP_SCK0_0_6            (6)     // Used by USBConnect
    #define CFG_SSP_SCK0_0_10           (10)    // Used by SWD
    #define CFG_SSP_SCK0_1_29           (29)

    #define CFG_SSP_MISO1_0_22          (22)
    #define CFG_SSP_MISO1_1_21          (21)
    #define CFG_SSP_MOSI1_0_21          (21)
    #define CFG_SSP_MOSI1_1_22          (22)
    #define CFG_SSP_SCK1_1_15           (15)
    #define CFG_SSP_SCK1_1_20           (20)

    // Select the appropriate pin locations here
    #define CFG_SSP_SCK0_LOCATION       (CFG_SSP_SCK0_1_29)
    #define CFG_SSP_MISO1_LOCATION      (CFG_SSP_MISO1_1_21)
    #define CFG_SSP_MOSI1_LOCATION      (CFG_SSP_MOSI1_1_22)
    #define CFG_SSP_SCK1_LOCATION       (CFG_SSP_SCK1_1_20)

    // Set the phase and polarity for SSP0 and SSP1
    #define CFG_SSP_CPOL0               (0)
    #define CFG_SSP_CPHA0               (0)   /* CC3000 = Mode 1 */
    #define CFG_SSP_CPOL1               (0)
    #define CFG_SSP_CPHA1               (0)
/*=========================================================================*/


/*=========================================================================
    PRINTF REDIRECTION
    -----------------------------------------------------------------------

    CFG_PRINTF_MAXSTRINGSIZE  Maximum size of string buffer for printf
    CFG_PRINTF_UART           Will cause all printf statements to be
                              redirected to UART
    CFG_PRINTF_USBCDC         Will cause all printf statements to be
                              redirect to USB Serial
    CFG_PRINTF_NEWLINE        This is typically "\r\n" for Windows or
                              "\n" for *nix

    Note: If no printf redirection definitions are present, all printf
    output will be ignored.
    -----------------------------------------------------------------------*/
    #define CFG_PRINTF_MAXSTRINGSIZE    (255)

    // #define CFG_PRINTF_UART
    #define CFG_PRINTF_USBCDC
    // #define CFG_PRINTF_DEBUG

    #ifdef CFG_PRINTF_DEBUG
      #define CFG_PRINTF_NEWLINE          "\n"
    #else
      #define CFG_PRINTF_NEWLINE          "\r\n"
    #endif
/*=========================================================================*/


/*=========================================================================
    COMMAND LINE INTERFACE
    -----------------------------------------------------------------------

    CFG_INTERFACE             If this field is defined the UART or USBCDC
                              based command-line interface will be included
    CFG_INTERFACE_MAXMSGSIZE  The maximum number of bytes to accept for an
                              incoming command
    CFG_INTERFACE_PROMPT      The command prompt to display at the start
                              of every new data entry line
    CFG_INTERFACE_SILENTMODE  If this is set to 1 only text generated in
                              response to commands will be send to the
                              output buffer.  The command prompt will not
                              be displayed and incoming text will not be
                              echoed back to the output buffer (allowing
                              you to see the text you have input).  This
                              is normally only desirable in a situation
                              where another MCU is communicating with
                              the LPC1343.
    CFG_INTERFACE_DROPCR      If this is set to 1 all incoming \r
                              characters will be dropped
    CFG_INTERFACE_ENABLEIRQ   If this is set to 1 the IRQ pin will be
                              set high when a command starts executing
                              and will go low when the command has
                              finished executing or the LCD is not busy.
                              This allows another device to know when a
                              new command can safely be sent.
    CFG_INTERFACE_IRQPORT     The gpio port for the IRQ/busy pin
    CFG_INTERFACE_IRQPIN      The gpio pin number for the IRQ/busy pin
    CFG_INTERFACE_SHORTERRORS If this is enabled only short 1 character
                              error messages will be returned (followed
                              by CFG_PRINTF_NEWLINE), rather than more
                              verbose error messages.  The specific
                              characters used are defined below.
    CFG_INTERFACE_CONFIRMREADY  If this is set to 1 a text confirmation
                              will be sent when the command prompt is
                              ready for a new command.  This is in
                              addition to CFG_INTERFACE_ENABLEIRQ if
                              this is also enabled.  The character used
                              is defined below.
    CFG_INTERFACE_LONGSYSINFO If this is set to 1 extra information will
                              be included in the Sys Info ('V') command
                              on the CLI. This can be useful when trying
                              to debug problems on remote HW, or with
                              unknown firmware.  It will also use about
                              0.5KB flash, though, so only enable it is
                              necessary.

    NOTE:                     The command-line interface will use either
                              USB-CDC or UART depending on whether
                              CFG_PRINTF_UART or CFG_PRINTF_USBCDC are
                              selected.
    -----------------------------------------------------------------------*/
    // #define CFG_INTERFACE
    #define CFG_INTERFACE_MAXMSGSIZE    (256)
    #define CFG_INTERFACE_PROMPT        "LPC1347 >> "
    #define CFG_INTERFACE_SILENTMODE    (0)
    #define CFG_INTERFACE_DROPCR        (0)
    #define CFG_INTERFACE_ENABLEIRQ     (0)
    #define CFG_INTERFACE_IRQPORT       (0)
    #define CFG_INTERFACE_IRQPIN        (7)
    #define CFG_INTERFACE_SHORTERRORS   (0)
    #define CFG_INTERFACE_CONFIRMREADY  (0)
    #define CFG_INTERFACE_LONGSYSINFO   (1)
/*=========================================================================*/


/*=========================================================================
    SIMPLE BINARY PROTOCOL
    -----------------------------------------------------------------------

