microbuilder/LPC11U_LPC13U_CodeBase/src/boards/lpcxpresso1347/board_lpcxpresso1347.h
    CFG_PROTOCOL            If this field is defined the binary command
                            parser will be included

	CFG_PROTOCOL_VIA_HID	Use USB HID for the binary protocol
							(requires CFG_USB_HID_GENERIC)
	CFG_PROTOCOL_VIA_BULK	Use USB Bulk for the binary protocol
							(requires CFG_USB_CUSTOM_CLASS)
	CFG_PROTOCO_VIA_SSP0	Uses SSP0 Slave for the binary protocol
	CFG_PROTOCO_VIA_SSP1	Uses SSP1 Slave for the binary protocol
    -----------------------------------------------------------------------*/
    #define CFG_PROTOCOL

    // #define CFG_PROTOCOL_VIA_HID
    // #define CFG_PROTOCOL_VIA_BULK
    #define CFG_PROTOCOL_VIA_SSP0
    // #define CFG_PROTOCOL_VIA_SSP1

    #if defined(CFG_PROTOCOL) && !defined(CFG_PROTOCOL_VIA_HID) && !defined(CFG_PROTOCOL_VIA_BULK) \
				&& !defined(CFG_PROTOCOL_VIA_SSP0) && !defined(CFG_PROTOCOL_VIA_SSP1)
        #error CFG_PROTOCOL must be enabled with either CFG_PROTOCOL_VIA_HID or CFG_PROTOCOL_VIA_BULK
    #endif
/*=========================================================================*/


/*=========================================================================
    TFT LCD
    -----------------------------------------------------------------------

    CFG_TFTLCD                  If defined, this will cause drivers for
                                a pre-determined LCD screen to be included
                                during build.  Only one LCD driver can be
                                included during the build process (for ex.
                                'drivers/displays/hw/ILI9325.c')
    CFG_TFTLCD_INCLUDESMALLFONTS If set to 1, smallfont support will be
                                included for 3x6, 5x8, 7x8 and 8x8 fonts.
                                This should only be enabled if these small
                                fonts are required since there is already
                                support for larger fonts generated with
                                Dot Factory
                                http://www.pavius.net/downloads/tools/53-the-dot-factory
    CFG_TFTLCD_USEAAFONTS       If set to a non-zero value, anti-aliased
                                fonts will be used instead of regular 1-bit
                                font.  These result in much higher-
                                quality text, but the fonts are 2 or 4
                                times larger than plain bitmap fonts and
                                take a bit more rendering time to display.
    CFG_TFTLCD_TS_DEFAULTTHRESHOLD  Default minimum threshold to trigger a
                                touch event with the touch screen (and exit
                                from 'tsWaitForEvent' in touchscreen.c).
                                Should be an 8-bit value somewhere between
                                8 and 75 in normal circumstances.  This is
                                the default value and may be overriden by
                                a value stored in EEPROM.
    CFG_TFTLCD_TS_KEYPADDELAY   The delay in milliseconds between key
                                presses in dialogue boxes
    ----------------------------------------------------------------------*/
    // #define CFG_TFTLCD
    #define CFG_TFTLCD_INCLUDESMALLFONTS   (1)
    #define CFG_TFTLCD_USEAAFONTS          (0)
    #define CFG_TFTLCD_TS_DEFAULTTHRESHOLD (50)
    #define CFG_TFTLCD_TS_KEYPADDELAY      (100)
/*=========================================================================*/


/*=========================================================================
    MICRO-SD CARD
    -----------------------------------------------------------------------

    CFG_SDCARD                If this field is defined SD Card and FAT32
                              file system support will be included
    CFG_SDCARD_SPIPORT        SSP Port used for the SD card (0 or 1)
    CFG_SDCARD_READONLY       If this is set to 1, all commands to
                              write to the SD card will be removed
                              saving some flash space.
    CFG_SDCARD_CDENABLED      If set to one, the card detect pin is used
                              to determine if an SD card is present
    CFG_SDCARD_CDPORT         The card detect port number
    CFG_SDCARD_CDPIN          The card detect pin number
    CFG_SDCARD_CDENABLED      If set to one, the enable pin will be used
                              to enable/disable the SD card (saves power)

    NOTE:                     All config settings for FAT32 are defined
                              in ffconf.h
    -----------------------------------------------------------------------*/
    // #define CFG_SDCARD
    #define CFG_SDCARD_READONLY         (0)   // Must be 0 or 1
    #define CFG_SDCARD_SPIPORT          (0)
    #define CFG_SDCARD_SSELPORT         (1)
    #define CFG_SDCARD_SSELPIN          (24)
    #define CFG_SDCARD_CDENABLED        (0)   // Must be 0 or 1
    #define CFG_SDCARD_CDPORT           (0)
    #define CFG_SDCARD_CDPIN            (0)
    #define CFG_SDCARD_ENBLENABLED      (0)   // Must be 0 or 1
    #define CFG_SDCARD_ENBLPORT         (0)
    #define CFG_SDCARD_ENBLPIN          (0)

    #ifdef CFG_SDCARD
      #if !((CFG_SDCARD_READONLY == 0) || (CFG_SDCARD_READONLY == 1))
        #error "Invalid value for CFG_SDCARD_READONLY"
      #endif
      #if !((CFG_SDCARD_CDENABLED == 0) || (CFG_SDCARD_CDENABLED == 1))
        #error "Invalid value for CFG_SDCARD_CDENABLED"
      #endif
      #if !((CFG_SDCARD_ENBLENABLED == 0) || (CFG_SDCARD_ENBLENABLED == 1))
        #error "Invalid value for CFG_SDCARD_ENBLENABLED"
      #endif
      #if !((CFG_SDCARD_SPIPORT == 0) || (CFG_SDCARD_SPIPORT == 1))
        #error "Invalid SPI port for CFG_SDCARD_SPIPORT"
      #endif
    #endif
/*=========================================================================*/


/*=========================================================================
    CHIBI WIRELESS STACK
    -----------------------------------------------------------------------

    CFG_CHIBI                   If defined, the CHIBI wireless stack will be
                                included during build.  Requires external HW.
    CFG_CHIBI_MODE              The mode to use when receiving and transmitting
                                wireless data.  See chb_drvr.h for possible values
    CFG_CHIBI_POWER             The power level to use when transmitting.  See
                                chb_drvr.h for possible values
    CFG_CHIBI_CHANNEL           802.15.4 Channel (0 = 868MHz, 1-10 = 915MHz)
    CFG_CHIBI_PANID             16-bit PAN Identifier (ex.0x1234)
    CFG_CHIBI_PROMISCUOUS       Set to 1 to enabled promiscuous mode or
                                0 to disable it.  If promiscuous mode is
                                enabled be sure to set CFG_CHIBI_BUFFERSIZE
                                to an appropriately large value (ex. 1024)
    CFG_CHIBI_BUFFERSIZE        The size of the message buffer in bytes
    -----------------------------------------------------------------------*/
    // #define CFG_CHIBI
    #define CFG_CHIBI_MODE              (0)                 // OQPSK_868MHZ
    #define CFG_CHIBI_POWER             (0xE9)              // CHB_PWR_EU2_3DBM
    #define CFG_CHIBI_CHANNEL           (0)                 // 868-868.6 MHz
    #define CFG_CHIBI_PANID             (0x1234)
    #define CFG_CHIBI_PROMISCUOUS       (0)
    #define CFG_CHIBI_BUFFERSIZE        (256)

