microbuilder/LPC11U_LPC13U_CodeBase/src/boards/lpcxpresso1347/board_lpcxpresso1347.h
    #define CFG_CHIBI_SPIPORT           (0)  // Must be 0 or 1
    #define CFG_CHIBI_SSPORT            (0)
    #define CFG_CHIBI_SSPIN             (0)
    #define CFG_CHIBI_EINTPORT          (0)
    #define CFG_CHIBI_EINTPIN           (0)
    #define CFG_CHIBI_RSTPORT           (0)
    #define CFG_CHIBI_RSTPIN            (0)
    #define CFG_CHIBI_SLPTRPORT         (0)
    #define CFG_CHIBI_SLPTRPIN          (0)
    #define CFG_CHIBI_CC1190_HGM_PORT   (0)   // Not used
    #define CFG_CHIBI_CC1190_HGM_PIN    (0)   // Not used

    #ifdef CFG_CHIBI
      #if !((CFG_CHIBI_SPIPORT == 0) || (CFG_CHIBI_SPIPORT == 1))
        #error "Invalid SPI port for CFG_CHIBI_SPIPORT"
      #endif
    #endif
/*=========================================================================*/


/*=========================================================================
    CC3000 WIFI MODULES
    -----------------------------------------------------------------------

    CFG_CC3000                     If defined, CC3000 support will be
                                   included during build.  Requires
                                   external HW
    -----------------------------------------------------------------------*/
    // #define CFG_CC3000
    #define CFG_CC3000_SPI_PORT         (0)
    #define CFG_CC3000_EN_PORT          (0)
    #define CFG_CC3000_EN_PIN           (14)
    #define CFG_CC3000_IRQ_PORT         (0)
    #define CFG_CC3000_IRQ_PIN          (16)
    #define CFG_CC3000_CS_PORT          (0)
    #define CFG_CC3000_CS_PIN           (17)

    #ifdef CFG_CC3000
      #if !((CFG_CC3000_SPI_PORT == 0) || (CFG_CC3000_SPI_PORT == 1))
        #error "Invalid SPI port for CFG_CC3000_SPI_PORT"
      #endif
    #endif
/*=========================================================================*/


/*=========================================================================
    PN532/NFC STACK
    -----------------------------------------------------------------------

    CFG_PN532                      If defined, the PN532/NFC stack will be
                                   included during build.  Requires
                                   external HW
    CFG_PN532_MEM_POOL_SIZE_BYTES  Size of the dynamic memory pool in bytes
                                   (used by pn532/mem_allocator/ when
                                   working with NDEF messages)
    -----------------------------------------------------------------------*/
    // #define CFG_PN532
    #define CFG_PN532_RSTPD_PORT                      (0)
    #define CFG_PN532_RSTPD_PIN                       (16)
    #define CFG_PN532_I2C_IRQPORT                     (0)
    #define CFG_PN532_I2C_IRQPIN                      (17)
    #define CFG_PN532_MEM_POOL_SIZE_BYTES             (1024)
/*=========================================================================*/


/*=========================================================================
    RTC SUPPORT
    -----------------------------------------------------------------------

    CFG_RTC                     If defined, RTC support will be included.
                                Requires external HW.
    -----------------------------------------------------------------------*/
    // #define CFG_RTC

    #if defined(CFG_RTC) && !defined(CFG_ENABLE_I2C)
      #error "CFG_ENABLE_I2C must be defined with CFG_RTC"
    #endif
/*=========================================================================*/


/*=========================================================================
    STEPPER MOTOR SUPPORT
    -----------------------------------------------------------------------

    CFG_STEPPER                 If defined, basic stepper motor support
                                will be included.  Requires external HW.
    -----------------------------------------------------------------------*/
    // #define CFG_STEPPER
    #define CFG_STEPPER_TIMER32                       (0)
    #define CFG_STEPPER_IN1_PORT                      (0)
    #define CFG_STEPPER_IN1_PIN                       (8)
    #define CFG_STEPPER_IN2_PORT                      (0)
    #define CFG_STEPPER_IN2_PIN                       (9)
    #define CFG_STEPPER_IN3_PORT                      (0)
    #define CFG_STEPPER_IN3_PIN                       (14)
    #define CFG_STEPPER_IN4_PORT                      (0)
    #define CFG_STEPPER_IN4_PIN                       (13)
/*=========================================================================*/


/*=========================================================================
    USB

    CFG_USB_STRING_MANUFACTURER Manufacturer name that will appear in the
                                device descriptor during USB enumeration
    CFG_USB_STRING_PRODUCT      Product name that will appear in the
                                device descriptor during USB enumeration
    CFG_USB_VENDORID            16-bit USB vendor ID
    USB_PRODUCT_ID              Define this to set a custom product ID
                                if you do not wish to use the 'auto'
                                product ID feature
    CFG_CDC                     Enable USB CDC support
    CFG_USB_HID_KEYBOARD        Enable USB HID keyboard emulation
    CFG_USB_HID_MOUSE           Enable USB HID mouse emulation for a five
                                button 'Windows' mouse with scroll wheels
    CFG_USB_HID_GENERIC         Enable USB HID Generic support for custom
                                in and out reports, with report size set
                                via CFG_USB_HID_GENERIC_REPORT_SIZE
    CFG_USB_MSC                 Enable USB Mass Storage support, pointing
                                to the SD card reader (requires mmc.c from
                                the FATFS drivers, but doesn't use FATFS)


    You can combine more than one USB class below and they will be
    automatically combined in a USB composite device within the limit of
    available USB endpoints.  The USB Product ID is calculated automatically
    based on the combination of classes defined below.

    NOTE: Windows requires the .inf file in '/core/usb' for CDC support
    -----------------------------------------------------------------------*/
    #ifdef CFG_ENABLE_USB
      #define CFG_USB_STRING_MANUFACTURER       "microBuilder.eu"
      #define CFG_USB_STRING_PRODUCT            "LPC1347 LPCXpresso"
      #define CFG_USB_VENDORID                  (0x1FC9)

      #define CFG_USB_CDC

