microbuilder/LPC11U_LPC13U_CodeBase/src/boards/lpcxpresso1347/board_lpcxpresso1347.h
      // #define CFG_USB_HID_KEYBOARD
      // #define CFG_USB_HID_MOUSE
      #define CFG_USB_HID_GENERIC
      #define CFG_USB_HID_GENERIC_REPORT_SIZE (64)

      // #define CFG_USB_MSC

      // #define CFG_USB_CUSTOM_CLASS

      #if (defined(CFG_USB_CDC)       || defined(CFG_USB_HID_KEYBOARD) || \
           defined(CFG_USB_HID_MOUSE) || defined(CFG_USB_HID_GENERIC)  || \
           defined(CFG_USB_MSC)       || defined(CFG_USB_CUSTOM_CLASS))
        #define CFG_USB
        #if defined(CFG_USB_HID_KEYBOARD) || defined(CFG_USB_HID_MOUSE) || defined(CFG_USB_HID_GENERIC)
          #define CFG_USB_HID
          #if defined(CFG_USB_HID_GENERIC) && (CFG_USB_HID_GENERIC_REPORT_SIZE > 64)
            #error "CFG_USB_HID_GENERIC_REPORT_SIZE exceeds the maximum value of 64 bytes (based on USB specs 2.0 for 'Full Speed Interrupt Endpoint Size')"
          #endif
        #endif
      #endif
    #endif
/*=========================================================================*/


/*=========================================================================
    CONFIG FILE VALIDATION

    Basic error checking to make sure that incompatible defines are not
    enabled at the same time, etc.

    -----------------------------------------------------------------------*/
    #if defined(CFG_INTERFACE) && !( defined CFG_PRINTF_UART || defined CFG_PRINTF_USBCDC || defined CFG_PRINTF_DEBUG)
      #error "At least one CFG_PRINTF target must be defined with CFG_INTERFACE"
    #endif

    #if defined(CFG_PRINTF_UART) && !defined(CFG_ENABLE_UART)
      #error "CFG_ENABLE_UART must be enabled with CFG_PRINTF_UART"
    #endif

    #if defined(CFG_PRINTF_USBCDC) && !defined(CFG_USB_CDC)
      #error "CFG_USB_CDC must be defined with CFG_PRINTF_USBCDC"
    #endif

    #if defined(CFG_USB_MSC) && !defined(CFG_SDCARD)
      #error "CFG_USB_MSC must be defined with CFG_SDCARD"
    #endif

    #if defined(CFG_PROTOCOL)
      #if defined(CFG_PROTOCOL_VIA_HID) && !defined(CFG_USB_HID_GENERIC)
        #error "CFG_PROTOCOL_VIA_HID requires CFG_USB_HID_GENERIC"
      #endif

      #if defined(CFG_PROTOCOL_VIA_BULK) && !defined(CFG_USB_CUSTOM_CLASS)
        #error "CFG_PROTOCOL_VIA_BULK requires CFG_USB_CUSTOM_CLASS to be defined"
      #endif
    #endif
/*=========================================================================*/

#ifdef __cplusplus
}
#endif

#endif
